{
  "users": [
    {
      "id": "001",
      "login": "loginMaster",
      "password": "passWord8",
      "registed_at": "06.02.2024",
      "role_id": 0
    },
    {
      "id": "c463",
      "login": "ivan",
      "password": "qwerty123",
      "registed_at": "2033-05-28 12:01",
      "role_id": 1
    }
  ],
  "roles": [
    {
      "id": "0",
      "name": "Admin"
    },
    {
      "id": "1",
      "name": "Moderator"
    },
    {
      "id": "2",
      "name": "User"
    },
    {
      "id": "3",
      "name": "Guest"
    }
  ],
  "posts": [
    {
      "id": "001",
      "title": "Великий князь московский Иван IV Грозный ",
      "image_url": "https://images.unsplash.com/photo-1578925518470-4def7a0f08bb?q=80&w=3271&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "В 1547 году великий князь московский Иван IV Грозный венчался на царство и стал, таким образом, первым российским царём. В 1549 году был созван первый сословно-представительный орган — Земский собор. Было создано вооружённое огнестрельным оружием стрелецкое войско. Уложение о службе 1555—1556 годов обязало всех землевладельцев выставлять воинов пропорционально площади земли.",
      "published_at": "02.01.2024"
    },
    {
      "id": "002",
      "title": "В 1654 году казаки Богдана Хмельницкого, поднявшие восстание против Польши.",
      "image_url": "https://images.unsplash.com/photo-1617094322832-1687ebe64f62?q=80&w=3270&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "В 1654 году казаки Богдана Хмельницкого, поднявшие восстание против Польши, присягнули на верность московскому царю Алексею. Этот акт привёл к русско-польской войне, в результате которой Киев, Смоленск и значительная часть Приднепровья попадает под власть Москвы.\n\nВ 1654 году казаки Богдана Хмельницкого, поднявшие восстание против Польши, присягнули на верность московскому царю Алексею. Этот акт привёл к русско-польской войне, в результате которой Киев, Смоленск и значительная часть Приднепровья попадает под власть Москвы.",
      "published_at": "11.02.2024"
    },
    {
      "id": "003",
      "title": "Расширение государства на юг привело к столкновению с могущественной Хазарией.",
      "image_url": "https://plus.unsplash.com/premium_photo-1695792938224-4fd327c05097?q=80&w=3270&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "Расширение государства на юг привело к столкновению с могущественной Хазарией, центр которой располагался на нижней Волге. Князь Святослав нанёс хазарам сокрушительный удар в 965 году. Его мать княгиня Ольга в частном порядке приняла христианство, а её внук Владимир окончательно закрепил христианство на Руси в 988 году.",
      "published_at": "13.02.2024"
    },
    {
      "id": "004",
      "title": "Великое княжество Московское ",
      "image_url": "https://news.store.rambler.ru/img/96c2232da46937f3e5c90d3f4cb81d73?img-format=auto&img-1-resize=height:400,fit:max&img-2-filter=sharpen",
      "content": "Почти сразу после этого на юге возникла Галицкая митрополия, а затем Литовская, существовавшие впоследствии с перерывами. Киевский митрополит в 1325 году вторично поменял резиденцию, переехав в Москву. Впоследствии великие княжества Московское и Литовское стремились к тому, чтобы именно их претендент занимал общерусскую митрополию или как минимум был свой митрополит в те периоды, когда общерусская митрополия контролировалась «чужим» претендентом.",
      "published_at": "03.02.2024"
    },
    {
      "id": "005",
      "title": "Россия была провозглашена республикой 1 сентября 1917 года",
      "image_url": "https://images.unsplash.com/photo-1596484552834-6a58f850e0a1?q=80&w=3270&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "Россия была провозглашена республикой 1 сентября 1917 года, хотя фактически стала ею 3 марта 1917 года в результате Февральской революции. С 10 января 1918 года — РСФСР. 30 декабря 1922 года РСФСР вместе с другими советскими республиками учредила СССР, неофициально его тоже часто называли «Россией».",
      "published_at": "06.02.2024"
    },
    {
      "id": "006",
      "title": "Жанр творческой фотографии",
      "image_url": "https://plus.unsplash.com/premium_photo-1673448390926-96e9751b839a?q=80&w=3271&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "Жанр творческой фотографии, очень сильно отличается от обычной фотожурналистики. Для многих фотография – способ самовыражения и общения, возможность высказаться и заявить о себе. Осень отлично подходит для фотографии, особенно если вы любите яркие цвета. Обратите внимание на то, как необычно и интересно может выглядеть портрет, если вы будете изменять ракурс. Фотография дает человеку возможность объективно посмотреть на себя, свои чувства, эмоции.",
      "published_at": "24.03.2024"
    },
    {
      "id": "007",
      "title": "Рис, гречка два отличных источника углеводов. ",
      "image_url": "https://images.unsplash.com/photo-1504674900247-0877df9cc836?q=80&w=3270&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "Именно их при диете можно употреблять в небольших порциях. сли уж без кофе совсем никак, тогда лучше пить его уже после еды, и с добавлением молока. Для правильного перекуса прекрасно подойдет яблоко, стакан кефира или горсть орехов. Правильный завтрак спортсмена или человека с высокой физической активностью, отличается от завтрака обычного человека. Здоровое питание укрепляет иммунитет, особенно если совмещать его с занятиями спортом и прогулками на свежем воздухе.",
      "published_at": "27.03.2024"
    },
    {
      "id": "008",
      "title": "Компьютерные технологии стали неотъемлемой частью жизни людей.",
      "image_url": "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?q=80&w=3269&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "content": "Эти технологии имеют свои корни. Возьмём, например, слово «мышка». Компьютерная мышь совсем не то же самое, что маленький грызун, который живёт в зданиях и полях. Это небольшой прибор, который вы двигаете туда-сюда по плоской поверхности, сидя за компьютером. Мышь перемещает стрелку (или курсор) на экране компьютера. Идея такого устройства пришла в голову специалисту по компьютерам Дугласу Энгельбарту в начале 60-х годов XX века. Первая компьютерная мышь представляла собой резной деревянный кубик с двумя металлическими колёсиками. Прибор назвали мышью, так как с одного конца у него был хвостик. Хвостом был провод, который присоединял устройство к компьютеру.",
      "published_at": "19.03.2024"
    },
    {
      "id": "6dbe",
      "image_url": "https://png.pngtree.com/thumb_back/fw800/background/20230612/pngtree-images-of-winter-and-white-background-wallpapers-free-download-image_2935697.jpg",
      "published_at": "2033-05-18 22:59",
      "title": "Морозная зима",
      "content": "Разнообразный и богатый опыт рамки и место обучения кадров способствует подготовки и реализации новых предложений. Задача организации, в особенности же начало повседневной работы по формированию позиции способствует подготовки и реализации системы обучения кадров, соответствует насущным потребностям. Равным образом сложившаяся структура организации позволяет оценить значение модели развития. Значимость этих проблем настолько очевидна, что постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации системы обучения кадров, соответствует насущным потребностям. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки новых предложений. Товарищи! консультация с широким активом представляет собой интересный эксперимент проверки системы обучения кадров, соответствует насущным потребностям.\n\n"
    },
    {
      "id": "7e8e",
      "image_url": "https://img.freepik.com/free-photo/mountains-lake_1398-1150.jpg",
      "published_at": "2033-05-29 08:54",
      "title": "Красота природы",
      "content": "Повседневная практика показывает, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Таким образом начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке направлений прогрессивного развития."
    },
    {
      "id": "7b84",
      "image_url": "https://cdnn21.img.ria.ru/images/07e7/05/0c/1871227916_0:245:3072:1973_1920x0_80_0_0_dcd717773ba62356a1a8fa8da3fb88b8.jpg",
      "published_at": "2033-05-27 14:20",
      "title": "Бездна космоса ",
      "content": "Разнообразный и богатый опыт новая модель организационной деятельности позволяет выполнять важные задания по разработке форм развития. Равным образом дальнейшее развитие различных форм деятельности позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. Задача организации, в особенности же постоянный количественный рост и сфера нашей активности влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям. Товарищи! дальнейшее развитие различных форм деятельности позволяет оценить значение дальнейших направлений развития."
    }
  ],
  "comments": [
    {
      "id": "3239",
      "authorId": "c463",
      "postId": "001",
      "publishedAt": "2033-05-26 02:45",
      "content": "мой первый комментарий\n"
    },
    {
      "id": "265e",
      "authorId": "001",
      "postId": "001",
      "publishedAt": "2033-05-29 07:51",
      "content": "тоже комментарий"
    },
    {
      "authorId": "001",
      "postId": "005",
      "publishedAt": "2033-05-22 01:03",
      "content": "Прекрасная картинка!",
      "id": "cIZWPmn"
    },
    {
      "authorId": "001",
      "postId": "004",
      "publishedAt": "2033-05-18 20:16",
      "content": "Больше исторических справок.",
      "id": "Boqmqt2"
    }
  ],
  "sessions": [
    {
      "hash": "0.67798296024924709080039519903948530554771423339844",
      "user": {
        "id": "001",
        "login": "loginMaster",
        "roleId": 0,
        "password": "passWord8",
        "registeredAt": "06.02.2024"
      },
      "id": 1
    }
  ]
}